//Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
/*
int num1 = Convert.ToInt32(Console.ReadLine());
int num2 = Convert.ToInt32(Console.ReadLine());

if (num1 > num2)
  {
    Console.WriteLine("Первое число больше");
  }
else if (num1 < num2)
  {
    Console.WriteLine("Первое число меньше");
  }
else
  {
    Console.WriteLine("Они одинаковые");
  }
*/

//Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
/*
int num1 = Convert.ToInt32(Console.ReadLine());
int num2 = Convert.ToInt32(Console.ReadLine());
int num3 = Convert.ToInt32(Console.ReadLine());

if (num1 > num2 && num1 > num3)
  {
    Console.WriteLine("Первое число максимальное");
  }
else if (num2 > num1 && num2 > num3)
  {
    Console.WriteLine("Второе число максимально");
  }
else if (num3 > num1 && num3 > num2)
 {
    Console.WriteLine("Третье число максимальное");
 }
*/

//Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
/*
int num1 = Convert.ToInt32(Console.ReadLine());

if (num1 % 2 == 0)
  {
    Console.WriteLine("Число четное");
  }
else if (num1 % 2 == 1)
  {
    Console.WriteLine("Чило не четное");
  }
*/

//Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

/*
Console.WriteLine("Введите число: ");
int num1 = Convert.ToInt32(Console.ReadLine());

for (int i = 1; i <= num1; i++)
  {
    if (i % 2 == 0)
      {
        Console.Write(i + ", ");
      }
  }
*/
